# Задание 1

Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [75]:
import pandas as pd

In [6]:
data_movies = pd.read_csv('/Users/viktoria/Documents/Netology/ht_repository/for_Pandas/ml-25m/movies.csv')
data_movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [7]:
data_ratings = pd.read_csv('/Users/viktoria/Documents/Netology/ht_repository/for_Pandas/ml-25m/ratings.csv')
data_ratings.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [63]:
n = data_ratings[ data_ratings.rating == 5.0 ].movieId.mode().values[0]

In [66]:
data_movies.title[ data_movies.movieId == n ].values[0]

'Shawshank Redemption, The (1994)'

# Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [45]:
data_power = pd.read_csv('/Users/viktoria/Documents/Netology/ht_repository/for_Pandas/power.csv')
data_power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [74]:
filtered_countries = data_power[ ((data_power['country']=='Latvia') | (data_power['country']=='Lithuania') | (data_power['country']=='Estonia')) & ((data_power['category'] == 4) | (data_power['category'] == 12) | (data_power['category'] == 21)) & (data_power['year'] > 2004) & (data_power['year'] < 2011) & (data_power['quantity'] > 0) ]

filtered_countries.quantity.values.sum()

240580.0

# Задание 3

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [86]:
html_table = pd.read_html('https://www.ucheba.ru/for-abiturients/vuz/rankings')
html_table[0]

,Вуз,Место в мире,Место в России
0,Московский государственный университет имени М...,74,1
1,Санкт-Петербургский государственный университет,225,2
2,Новосибирский национальный исследовательский г...,228,3